TensorFlow version: 2.2.0
Dataset used: part_7
Size of shuffle buffer (size of whole dataset): 5459
Batch size: 50
Epochs: 25
Droput rate: 0.2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
masking (Masking)            (None, 66, 20)            0         
_________________________________________________________________
bidirectional (Bidirectional (None, 66, 128)           43520     
_________________________________________________________________
bidirectional_1 (Bidirection (None, 128)               98816     
_________________________________________________________________
dropout (Dropout)            (None, 128)               0         
_________________________________________________________________
dense (Dense)                (None, 1)                 129       
=================================================================
Total params: 142,465
Trainable params: 142,465
Non-trainable params: 0
_________________________________________________________________
